Updated the Quick Start and Boilerplate Manual
